"""
קובץ הגדרות לפרויקט.

כאן אנחנו קובעים איך השרת יתנהג,
ואיפה הוא ימצא את מסד הנתונים שלו.
"""
import os

class Config: # תצורה-הגדרות כלליות של השרת
    """
    כאן נמצאות ההגדרות הכלליות של השרת, של האתר שלנו,
    ובעיקר חיבור למסד הנתונים.
    זה כמו "לוח הבקרה" שקובע לאן הנתונים הולכים.
    """

    # השורה הזו עוזרת למחשב להבין איפה בדיוק נמצאת התיקייה של הפרויקט
    # יוצר נתיב מוחלט (absolute path), קובץ מקומי בשם recipes.db
    BASE_DIR = os.path.abspath(os.path.dirname(__file__))

    # כאן אנחנו מחברים את האתר למסד הנתונים:
    # אנחנו אומרים לו: "צור קובץ בשם recipes.db בתוך התיקייה של הפרויקט".
    SQLALCHEMY_DATABASE_URI = f"sqlite:///{os.path.join(BASE_DIR, 'recipes.db')}"

    # מכבה מערכת מעקב שינויים מיותר שמאט את המחשב וממלא את המסך באזהרות.
    SQLALCHEMY_TRACK_MODIFICATIONS = False

    # זהו 'המפתח הסודי' של האתר.
    # הוא משמש כסיסמת אבטחה פנימית שנועלת את הנתונים
    # ומוודאת שהאקרים לא יוכלו לזייף פעולות באתר
    # כמו מידע שעובר בטפסים (כמו הוספת מתכון).
    SECRET_KEY = os.environ.get('SECRET_KEY') or 'dev-key-placeholder'





    # הערות בשבילי😉
    # מה קרה פה בדף?
    # בחירת הגדרת החיבור למסד הנתונים באמצעות נתיב מוחלט בעזרת os,
    # כדי למנוע תלות בתיקיית ההרצה ולאפשר יציבות בפרויקט.
    # בנוסף הוספת SECRET_KEY כהכנה לעבודה מאובטחת בהמשך.