"""
BaseModel – מחלקת בסיס אבסטקטית לכל הטבלאות בפרויקט.
למניעת כפילויות קוד, כל המודלים ירשו ממחלקה זו.
מכילה:
- id (מפתח ראשי ייחודי)
- פונקציית save() לשמירת האובייקט במסד הנתונים
"""

from database import db


class BaseModel(db.Model):
    """
    מחלקה זו היא ה"אמא" של כל שאר המודלים.
    היא לא יוצרת טבלה בעצמה, אלא רק נותנת כלים לאחרות.
    """

    # מסמנים למערכת לא ליצור טבלה וזוהי רק תוכנית עבודה (שלד)
    # (לא טבלה אמיתית בתוך מסד הנתונים)
    __abstract__ = True

    # לכל פריט במערכת (מתכון, משתמש וכו') יהיה מספר מזהה ייחודי משלו באופן אוטומטי
    id = db.Column(db.Integer, primary_key=True)

    def save(self):
        """
        פונקציה לביצוע שמירה מהירה במסד הנתונים.
        במקום לכתוב שתי שורות בכל פעם, פשוט קוראים ל-.save()
        """
        # מוסיפים את המידע החדש ל"רשימת ההמתנה"
        db.session.add(self)
        # מבצעים Commit - אישור סופי לשמירת הנתונים
        db.session.commit()